Revit 2022 API
UnitUtils.IsSpec Method
 Checks whether a ForgeTypeId identifies a spec associated with units of measurement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `IsMeasurableSpec(ForgeTypeId)` method instead.")]
public static bool IsSpec(
	ForgeTypeId specTypeId
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `IsMeasurableSpec(ForgeTypeId)` method instead.")> _
Public Shared Function IsSpec ( _
	specTypeId As ForgeTypeId _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `IsMeasurableSpec(ForgeTypeId)` method instead.")]
public:
static bool IsSpec(
	ForgeTypeId^ specTypeId
)
Parameters
specTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 The identifier to check.
Return Value
 True if the ForgeTypeId identifies a measurable spec, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace